stm32duino/STM32LowPower/src/low_power.c
/**
  ******************************************************************************
  * @file    LowPower.c
  * @author  Frederic Pillon
  * @brief   Provides a Low Power interface
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020-2021, STMicroelectronics
  * All rights reserved.
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

#include "Arduino.h"
#include "low_power.h"
#include "stm32yyxx_ll_cortex.h"
#include "stm32yyxx_ll_pwr.h"

#if defined(HAL_PWR_MODULE_ENABLED) && !defined(HAL_PWR_MODULE_ONLY)

#if defined(HAL_UART_MODULE_ENABLED) && !defined(HAL_UART_MODULE_ONLY) \
  && (defined(UART_IT_WUF) || defined(LPUART1_BASE))
  #define UART_WKUP_SUPPORT
#endif

#ifdef __cplusplus
extern "C" {
#endif

#if defined(UART_WKUP_SUPPORT)
/* Save UART handler for callback */
static UART_HandleTypeDef *WakeUpUart = NULL;
#endif
/* Save callback pointer */
static void (*WakeUpUartCb)(void) = NULL;

#if defined(PWR_WAKEUP_SELECT_0) || defined(PWR_WAKEUP1_SOURCE_SELECTION_0)
typedef struct {
  PinName pin;
  uint32_t wkup_pin;
  uint32_t selection;
#if defined(PWR_WAKEUP1_SOURCE_SELECTION_0)
  uint32_t low;
#endif
} WakePinSel;

const WakePinSel WakeupPinSel[] = {
#if defined(PWR_WAKEUP_SELECT_0)
  /* PWR_WAKEUP_SELECT_0 */
  {PA_0,    PWR_WAKEUP_LINE1, PWR_WAKEUP_SELECT_0},
  {PA_4,    PWR_WAKEUP_LINE2, PWR_WAKEUP_SELECT_0},
  {PE_6,    PWR_WAKEUP_LINE3, PWR_WAKEUP_SELECT_0},
  {PA_2,    PWR_WAKEUP_LINE4, PWR_WAKEUP_SELECT_0},
  {PC_5,    PWR_WAKEUP_LINE5, PWR_WAKEUP_SELECT_0},
  {PB_5,    PWR_WAKEUP_LINE6, PWR_WAKEUP_SELECT_0},
  {PB_15,   PWR_WAKEUP_LINE7, PWR_WAKEUP_SELECT_0},
  /* PWR_WAKEUP_SELECT_1 */
  {PB_2,    PWR_WAKEUP_LINE1, PWR_WAKEUP_SELECT_1},
  {PC_13,   PWR_WAKEUP_LINE2, PWR_WAKEUP_SELECT_1},
  {PA_1,    PWR_WAKEUP_LINE3, PWR_WAKEUP_SELECT_1},
  {PB_1,    PWR_WAKEUP_LINE4, PWR_WAKEUP_SELECT_1},
  {PA_3,    PWR_WAKEUP_LINE5, PWR_WAKEUP_SELECT_1},
  {PA_5,    PWR_WAKEUP_LINE6, PWR_WAKEUP_SELECT_1},
  {PA_6,    PWR_WAKEUP_LINE7, PWR_WAKEUP_SELECT_1},
  {PA_7,    PWR_WAKEUP_LINE8, PWR_WAKEUP_SELECT_1},
  /* PWR_WAKEUP_SELECT_2 */
  {PE_4,    PWR_WAKEUP_LINE1, PWR_WAKEUP_SELECT_2},
  {PE_5,    PWR_WAKEUP_LINE2, PWR_WAKEUP_SELECT_2},
  {PB_6,    PWR_WAKEUP_LINE3, PWR_WAKEUP_SELECT_2},
  {PB_7,    PWR_WAKEUP_LINE4, PWR_WAKEUP_SELECT_2},
  {PB_8,    PWR_WAKEUP_LINE5, PWR_WAKEUP_SELECT_2},
  {PE_7,    PWR_WAKEUP_LINE6, PWR_WAKEUP_SELECT_2},
  {PE_8,    PWR_WAKEUP_LINE7, PWR_WAKEUP_SELECT_2},
  {PB_10,   PWR_WAKEUP_LINE8, PWR_WAKEUP_SELECT_2},
  {NC,   0, 0}
#else /* PWR_WAKEUP_SELECT_0 */
  /* PWR_WAKEUPx_SOURCE_SELECTION_0 */
  {PA_0,    PWR_WAKEUP_PIN1, PWR_WAKEUP1_SOURCE_SELECTION_0, PWR_WAKEUP1_POLARITY_LOW},
#if defined(PWR_WAKEUP2_SOURCE_SELECTION_0)
  {PA_4,    PWR_WAKEUP_PIN2, PWR_WAKEUP2_SOURCE_SELECTION_0, PWR_WAKEUP2_POLARITY_LOW},
#endif
#if defined(PWR_WAKEUP3_SOURCE_SELECTION_0)
  {PE_6,    PWR_WAKEUP_PIN3, PWR_WAKEUP3_SOURCE_SELECTION_0, PWR_WAKEUP3_POLARITY_LOW},
#endif
  {PA_2,    PWR_WAKEUP_PIN4, PWR_WAKEUP4_SOURCE_SELECTION_0, PWR_WAKEUP4_POLARITY_LOW},
#if defined(PWR_WAKEUP5_SOURCE_SELECTION_0)
  {PC_5,    PWR_WAKEUP_PIN5, PWR_WAKEUP5_SOURCE_SELECTION_0, PWR_WAKEUP5_POLARITY_LOW},
#endif
#if defined(PWR_WAKEUP8_SOURCE_SELECTION_0)
  /* STM32U5xx */
  {PB_5,    PWR_WAKEUP_PIN6, PWR_WAKEUP6_SOURCE_SELECTION_0, PWR_WAKEUP6_POLARITY_LOW},
  {PB_15,   PWR_WAKEUP_PIN7, PWR_WAKEUP7_SOURCE_SELECTION_0, PWR_WAKEUP7_POLARITY_LOW},
  {PF_2,    PWR_WAKEUP_PIN8, PWR_WAKEUP8_SOURCE_SELECTION_0, PWR_WAKEUP8_POLARITY_LOW},
#else
  /* STM32WBAxx */
  {PA_12,   PWR_WAKEUP_PIN6, PWR_WAKEUP6_SOURCE_SELECTION_0, PWR_WAKEUP6_POLARITY_LOW},
  {PB_14,   PWR_WAKEUP_PIN7, PWR_WAKEUP7_SOURCE_SELECTION_0, PWR_WAKEUP7_POLARITY_LOW},
#endif
  /* PWR_WAKEUPx_SOURCE_SELECTION_1 */
#if defined(PWR_WAKEUP1_SOURCE_SELECTION_1)
  {PB_2,    PWR_WAKEUP_PIN1, PWR_WAKEUP1_SOURCE_SELECTION_1, PWR_WAKEUP1_POLARITY_LOW},
#endif
#if defined(PWR_WAKEUP2_SOURCE_SELECTION_1)
  {PC_13,   PWR_WAKEUP_PIN2, PWR_WAKEUP2_SOURCE_SELECTION_1, PWR_WAKEUP2_POLARITY_LOW},
#endif
  {PA_1,    PWR_WAKEUP_PIN3, PWR_WAKEUP3_SOURCE_SELECTION_1, PWR_WAKEUP3_POLARITY_LOW},
#if defined(PWR_WAKEUP4_SOURCE_SELECTION_1)
  {PB_1,    PWR_WAKEUP_PIN4, PWR_WAKEUP4_SOURCE_SELECTION_1, PWR_WAKEUP4_POLARITY_LOW},
#endif
#if defined(PWR_WAKEUP5_SOURCE_SELECTION_1)
  {PA_3,    PWR_WAKEUP_PIN5, PWR_WAKEUP5_SOURCE_SELECTION_1, PWR_WAKEUP5_POLARITY_LOW},
#endif
  {PA_5,    PWR_WAKEUP_PIN6, PWR_WAKEUP6_SOURCE_SELECTION_1, PWR_WAKEUP6_POLARITY_LOW},
  {PA_6,    PWR_WAKEUP_PIN7, PWR_WAKEUP7_SOURCE_SELECTION_1, PWR_WAKEUP7_POLARITY_LOW},
  {PA_7,    PWR_WAKEUP_PIN8, PWR_WAKEUP8_SOURCE_SELECTION_1, PWR_WAKEUP8_POLARITY_LOW},
  /* PWR_WAKEUPx_SOURCE_SELECTION_2 */
#if defined(PWR_WAKEUP1_SOURCE_SELECTION_2)
  {PE_4,    PWR_WAKEUP_PIN1, PWR_WAKEUP1_SOURCE_SELECTION_2, PWR_WAKEUP1_POLARITY_LOW},
#endif
#if defined(PWR_WAKEUP2_SOURCE_SELECTION_2)
  {PE_5,    PWR_WAKEUP_PIN2, PWR_WAKEUP2_SOURCE_SELECTION_2, PWR_WAKEUP2_POLARITY_LOW},
#endif
#if defined(PWR_WAKEUP3_SOURCE_SELECTION_2)
  {PB_6,    PWR_WAKEUP_PIN3, PWR_WAKEUP3_SOURCE_SELECTION_2, PWR_WAKEUP3_POLARITY_LOW},
#endif
#if defined(PWR_WAKEUP4_SOURCE_SELECTION_2)
  {PB_7,    PWR_WAKEUP_PIN4, PWR_WAKEUP4_SOURCE_SELECTION_2, PWR_WAKEUP4_POLARITY_LOW}, /* Only for STM32U5 */
#endif
#if defined(PWR_WAKEUP5_SOURCE_SELECTION_2)
  {PB_7,    PWR_WAKEUP_PIN5, PWR_WAKEUP5_SOURCE_SELECTION_2, PWR_WAKEUP5_POLARITY_LOW}, /* Only for STM32WBA */
  {PB_8,    PWR_WAKEUP_PIN5, PWR_WAKEUP5_SOURCE_SELECTION_2, PWR_WAKEUP5_POLARITY_LOW}, /* Only for STM32U5 */
#endif
#if defined(PWR_WAKEUP6_SOURCE_SELECTION_2)
  {PE_7,    PWR_WAKEUP_PIN6, PWR_WAKEUP6_SOURCE_SELECTION_2, PWR_WAKEUP6_POLARITY_LOW},
#endif
#if defined(PWR_WAKEUP7_SOURCE_SELECTION_2)
  {PE_8,    PWR_WAKEUP_PIN7, PWR_WAKEUP7_SOURCE_SELECTION_2, PWR_WAKEUP7_POLARITY_LOW},
#endif
#if defined(PWR_WAKEUP8_SOURCE_SELECTION_2)
  {PB_9,    PWR_WAKEUP_PIN8, PWR_WAKEUP8_SOURCE_SELECTION_2, PWR_WAKEUP8_POLARITY_LOW}, /* Only for STM32WBA */
  {PB_10,   PWR_WAKEUP_PIN8, PWR_WAKEUP8_SOURCE_SELECTION_2, PWR_WAKEUP8_POLARITY_LOW}, /* Only for STM32U5 */
#endif
  {NC,   0, 0, 0}
#endif /* PWR_WAKEUP_SELECT_0 */
};
#endif /* PWR_WAKEUP_SELECT_0 || PWR_WAKEUP1_SOURCE_SELECTION_0 */


#if defined(PWR_FLAG_WUF)
#define PWR_FLAG_WU PWR_FLAG_WUF
#elif defined(PWR_WAKEUP_ALL_FLAG)
#define PWR_FLAG_WU PWR_WAKEUP_ALL_FLAG
#elif defined(PWR_WU_FLAG_ALL)
#define PWR_FLAG_WU PWR_WU_FLAG_ALL
#endif
#if defined(PWR_FLAG_SBF)
#define PWR_FLAG_SB PWR_FLAG_SBF
#endif

/**
  * @brief  Initialize low power mode
  * @param  None
  * @retval None
  */
void LowPower_init()
{
#if defined(__HAL_RCC_PWR_CLK_ENABLE)
  /* Enable Power Clock */
  __HAL_RCC_PWR_CLK_ENABLE();
#endif

#if defined(PWR_CR_DBP) || defined(PWR_CR1_DBP) || defined(PWR_DBPR_DBP)
  /* Allow access to Backup domain */
  HAL_PWR_EnableBkUpAccess();
#endif

#ifdef __HAL_RCC_WAKEUPSTOP_CLK_CONFIG
  /* Ensure that HSI is wake-up system clock */
  __HAL_RCC_WAKEUPSTOP_CLK_CONFIG(RCC_STOP_WAKEUPCLOCK_HSI);
#endif
#ifdef PWR_FLAG_SB
  /* Check if the system was resumed from StandBy mode */
  if (__HAL_PWR_GET_FLAG(PWR_FLAG_SB) != RESET) {
    /* Clear Standby flag */
    __HAL_PWR_CLEAR_FLAG(PWR_FLAG_SB);
  }
#endif
  /* Clear all related wakeup flags */
  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);
}

/**
  * @brief  Configure a pin as wakeup source if compatible.
  * @param  pin: pin to configure
  * @param  mode: pin mode (edge or state). The configuration have to be compatible.
  * @retval None
  */
void LowPower_EnableWakeUpPin(uint32_t pin, uint32_t mode)
{
  PinName p = digitalPinToPinName(pin);
#if defined(PWR_WAKEUP_SELECT_0) || defined(PWR_WAKEUP1_SOURCE_SELECTION_0)
  /* Two cases:
   * 1- STM32U5 and STM32WBA provides a compatible way to configure
   *    the wakeup pin using HAL_PWR_EnableWakeUpPin but only selection 0
   *    pins are managed.
   * 2- STM32U3 uses HAL_PWR_EnableWakeUpLine.
   */
  /* First find index of the pin if valid */
  WakePinSel *WakeupPinSel_idx = (WakePinSel *) WakeupPinSel;

  /* Read through PinMapAnalogSwitch array */
  while (WakeupPinSel_idx->pin != NC) {
    /* Check whether pin is or is associated to dualpad Analog Input */
    if (WakeupPinSel_idx->pin == p) {
      break;
    }
    WakeupPinSel_idx ++;
  }
  if (WakeupPinSel_idx->pin != NC) {
#if defined(PWR_WAKEUP1_SOURCE_SELECTION_0)
    uint32_t wkup_pin = WakeupPinSel_idx->wkup_pin | WakeupPinSel_idx->selection;
    if (mode != RISING) {
      wkup_pin |= PWR_WAKEUP1_POLARITY_LOW;
    }
    if (IS_PWR_WAKEUP_PIN(wkup_pin)) {
      HAL_PWR_EnableWakeUpPin(wkup_pin);
    }
#else
    if (IS_PWR_WAKEUP_LINE(WakeupPinSel_idx->wkup_pin)) {
      HAL_PWR_EnableWakeUpLine(WakeupPinSel_idx->wkup_pin, WakeupPinSel_idx->selection, (mode != RISING) ? PWR_WAKEUP_POLARITY_LOW : PWR_WAKEUP_POLARITY_HIGH);
      /* Enable the NVIC for Wake-up pin */
      HAL_NVIC_SetPriority(PWR_IRQn, 0, 0x00);
      HAL_NVIC_EnableIRQ(PWR_IRQn);
    }
#endif /* PWR_WAKEUP1_SOURCE_SELECTION_0 */
  }
#elif defined(PWR_WAKEUP_PA0)
  uint32_t wkup_pin = 0;
  if (p != NC) {
#if defined(PWR_WAKEUP_PB0)
    if (p == PB_0) {
      wkup_pin = PWR_WAKEUP_PB0;
    }
#endif
#ifdef PWR_WAKEUP_PB1
    if (p == PB_1) {
      wkup_pin = PWR_WAKEUP_PB1;
    }
#endif
#ifdef PWR_WAKEUP_PB2
    if (p == PB_2) {
      wkup_pin = PWR_WAKEUP_PB0;
    }
#endif
#ifdef PWR_WAKEUP_PB3
    if (p == PB_3) {
      wkup_pin = PWR_WAKEUP_PB3;
    }
#endif
#ifdef PWR_WAKEUP_PB4
    if (p == PB_4) {
      wkup_pin = PWR_WAKEUP_PB4;
    }
#endif
#ifdef PWR_WAKEUP_PB5
    if (p == PB_5) {
      wkup_pin = PWR_WAKEUP_PB5;
    }
#endif
#ifdef PWR_WAKEUP_PB6
    if (p == PB_6) {
      wkup_pin = PWR_WAKEUP_PB6;
    }
#endif
#ifdef PWR_WAKEUP_PB7
    if (p == PB_7) {
      wkup_pin = PWR_WAKEUP_PB7;
    }
#endif
#ifdef PWR_WAKEUP_PA8
    if (p == PA_8) {
      wkup_pin = PWR_WAKEUP_PA8;
    }
#endif
#ifdef PWR_WAKEUP_PA9
    if (p == PA_9) {
      wkup_pin = PWR_WAKEUP_PA9;
    }
#endif
#ifdef PWR_WAKEUP_PA10
    if (p == PA_10) {
      wkup_pin = PWR_WAKEUP_PA10;
    }
#endif
#ifdef PWR_WAKEUP_PA11
    if (p == PA_11) {
      wkup_pin = PWR_WAKEUP_PA11;
    }
#endif
#ifdef PWR_WAKEUP_PA0
    if (p == PA_0) {
      wkup_pin = PWR_WAKEUP_PA0;
    }
#endif
#ifdef PWR_WAKEUP_PA1
    if (p == PA_1) {
      wkup_pin = PWR_WAKEUP_PA1;
    }
#endif
#ifdef PWR_WAKEUP_PA2
    if (p == PA_2) {
      wkup_pin = PWR_WAKEUP_PA2;
    }
#endif
#ifdef PWR_WAKEUP_PA3
    if (p == PA_3) {
      wkup_pin = PWR_WAKEUP_PA3;
    }
#endif
#ifdef PWR_WAKEUP_PA4
    if (p == PA_4) {
      wkup_pin = PWR_WAKEUP_PA4;
    }
#endif
#ifdef PWR_WAKEUP_PA5
    if (p == PA_5) {
      wkup_pin = PWR_WAKEUP_PA5;
    }
#endif
#ifdef PWR_WAKEUP_PA6
    if (p == PA_6) {
      wkup_pin = PWR_WAKEUP_PA6;
    }
#endif
#ifdef PWR_WAKEUP_PA7
    if (p == PA_7) {
      wkup_pin = PWR_WAKEUP_PA7;
    }
#endif
#ifdef PWR_WAKEUP_PB8
    if (p == PB_8) {
      wkup_pin = PWR_WAKEUP_PB8;
    }
#endif
#ifdef PWR_WAKEUP_PB9
    if (p == PB_9) {
      wkup_pin = PWR_WAKEUP_PB9;
    }
#endif
#ifdef PWR_WAKEUP_PB10
    if (p == PB_10) {
      wkup_pin = PWR_WAKEUP_PB10;
    }
#endif
#ifdef PWR_WAKEUP_PB11
    if (p == PB_11) {
      wkup_pin = PWR_WAKEUP_PB11;
    }
#endif
#ifdef PWR_WAKEUP_PA12
    if (p == PA_12) {
      wkup_pin = PWR_WAKEUP_PA12;
    }
#endif
#ifdef PWR_WAKEUP_PA13
    if (p == PA_13) {
      wkup_pin = PWR_WAKEUP_PA13;
    }
#endif
#ifdef PWR_WAKEUP_PA14
    if (p == PA_14) {
      wkup_pin = PWR_WAKEUP_PA14;
    }
#endif
#ifdef PWR_WAKEUP_PA15
    if (p == PA_15) {
      wkup_pin = PWR_WAKEUP_PA15;
    }
#endif
    if (IS_PWR_WAKEUP_PIN(wkup_pin)) {
      HAL_PWR_EnableWakeUpPin(wkup_pin, ((mode == RISING) || (mode == HIGH)) ? PWR_WUP_FALLEDG : PWR_WUP_RISIEDG);
    }
  }
#elif defined(PWR_WAKEUP_PORTA)
  /* Get GPIO port from pinname*/
  GPIO_TypeDef *port = get_GPIO_Port(STM_PORT(p));
  uint32_t wkup_pin = 0;
  uint32_t wkup_port = 0;
  switch (STM_PIN(p)) {
    case 0:
      wkup_pin = PWR_WAKEUP_PIN0;
      break;
    case 1:
      wkup_pin = PWR_WAKEUP_PIN1;
      break;
    case 2:
      wkup_pin = PWR_WAKEUP_PIN2;
      break;
    case 3:
      wkup_pin = PWR_WAKEUP_PIN3;
      break;
    case 4:
      wkup_pin = PWR_WAKEUP_PIN4;
      break;
    case 5:
      wkup_pin = PWR_WAKEUP_PIN5;
      break;
    case 6:
      wkup_pin = PWR_WAKEUP_PIN6;
      break;
    case 7:
      wkup_pin = PWR_WAKEUP_PIN7;
      break;
    case 8:
      wkup_pin = PWR_WAKEUP_PIN8;
      break;
    case 9:
      wkup_pin = PWR_WAKEUP_PIN9;
      break;
    case 10:
      wkup_pin = PWR_WAKEUP_PIN10;
      break;
    case 11:
      wkup_pin = PWR_WAKEUP_PIN11;
      break;
    case 12:
      wkup_pin = PWR_WAKEUP_PIN12;
      break;
    case 13:
      wkup_pin = PWR_WAKEUP_PIN13;
      break;
    case 14:
      wkup_pin = PWR_WAKEUP_PIN14;
      break;
    case 15:
      wkup_pin = PWR_WAKEUP_PIN15;
      break;
    default:
      port = NULL;
      break;
  }
  if (port == (GPIO_TypeDef *)GPIOA_BASE) {
    wkup_port = PWR_WAKEUP_PORTA;
  } else if (port == (GPIO_TypeDef *)GPIOB_BASE) {
    wkup_port = PWR_WAKEUP_PORTB;
  }
  if (IS_PWR_WAKEUP_SOURCE(wkup_pin)) {
    HAL_PWR_EnableWakeUpPin(wkup_port, wkup_pin, ((mode == RISING) || (mode == HIGH)) ? PWR_WUP_FALLEDG : PWR_WUP_RISIEDG);
  }
#else
#if !defined(PWR_WAKEUP_PIN1_HIGH)
  UNUSED(mode);
#endif
  uint32_t wkup_pin = 0;
  if (p != NC) {
#if defined(PWR_WAKEUP_PIN1)
    if (p == SYS_WKUP1) {
      wkup_pin = PWR_WAKEUP_PIN1;
#ifdef PWR_WAKEUP_PIN1_HIGH
      if (mode != RISING) {
        wkup_pin = PWR_WAKEUP_PIN1_LOW;
      }
#endif
    }
#endif /* PWR_WAKEUP_PIN1 */
#ifdef PWR_WAKEUP_PIN2
    if (p == SYS_WKUP2) {
      wkup_pin = PWR_WAKEUP_PIN2;
#ifdef PWR_WAKEUP_PIN2_HIGH
      if (mode != RISING) {
        wkup_pin = PWR_WAKEUP_PIN2_LOW;
      }
#endif
    }
#endif /* PWR_WAKEUP_PIN2 */
#ifdef PWR_WAKEUP_PIN3
    if (p == SYS_WKUP3) {
      wkup_pin = PWR_WAKEUP_PIN3;
#ifdef PWR_WAKEUP_PIN3_HIGH
      if (mode != RISING) {
        wkup_pin = PWR_WAKEUP_PIN3_LOW;
      }
#endif
    }
#endif /* PWR_WAKEUP_PIN3 */
#ifdef PWR_WAKEUP_PIN4
    if (p == SYS_WKUP4) {
      wkup_pin = PWR_WAKEUP_PIN4;
#ifdef PWR_WAKEUP_PIN4_HIGH
      if (mode != RISING) {
        wkup_pin = PWR_WAKEUP_PIN4_LOW;
      }
#endif
    }
#endif /* PWR_WAKEUP_PIN4 */
#ifdef PWR_WAKEUP_PIN5
    if (p == SYS_WKUP5) {
      wkup_pin = PWR_WAKEUP_PIN5;
#ifdef PWR_WAKEUP_PIN5_HIGH
      if (mode != RISING) {
        wkup_pin = PWR_WAKEUP_PIN5_LOW;
      }
#endif
    }
#endif /* PWR_WAKEUP_PIN5 */
#ifdef PWR_WAKEUP_PIN6
    if (p == SYS_WKUP6) {
      wkup_pin = PWR_WAKEUP_PIN6;
#ifdef PWR_WAKEUP_PIN6_HIGH
      if (mode != RISING) {
        wkup_pin = PWR_WAKEUP_PIN6_LOW;
      }
#endif
    }
#endif /* PWR_WAKEUP_PIN6 */
#ifdef PWR_WAKEUP_PIN7
    if (p == SYS_WKUP7) {
      wkup_pin = PWR_WAKEUP_PIN7;
#ifdef PWR_WAKEUP_PIN7_HIGH
      if (mode != RISING) {
        wkup_pin = PWR_WAKEUP_PIN7_LOW;
      }
#endif
    }
#endif /* PWR_WAKEUP_PIN7 */
#ifdef PWR_WAKEUP_PIN8
    if (p == SYS_WKUP8) {
      wkup_pin = PWR_WAKEUP_PIN8;
#ifdef PWR_WAKEUP_PIN8_HIGH
      if (mode != RISING) {
        wkup_pin = PWR_WAKEUP_PIN8_LOW;
      }
#endif
    }
#endif /* PWR_WAKEUP_PIN8 */
    if (IS_PWR_WAKEUP_PIN(wkup_pin)) {
      HAL_PWR_EnableWakeUpPin(wkup_pin);
    }
  }
#endif /* !PWR_WAKEUP_SELECT_0 && !PWR_WAKEUP1_SOURCE_SELECTION_0 */
}

